#include "print_interface.h"


void print_options(void)
{
    printf("\n");
    printf("Выберите опцию:\n");
    printf("1. Чтение данных из файла (инициализация файла)\n");
    printf("2. Добавление данных в массив\n");
    printf("3. Удаление данных из массива по заданному полю\n");
    printf("4. Просмотр таблицы\n");
    printf("5. Просмотр таблицы ключей\n");
    printf("6. Вывести список студентов указанного года поступления, живущих в съемном жилье, стоимостью меньше указанного\n");
    printf("7. Сортировка таблицы методом сортировки пузырьком\n");
    printf("8. Сортировка таблицы методом быстрой сортировки\n");
    printf("9. Сортировка таблицы ключей методом сортировки пузырьком\n");
    printf("10. Сортировка таблицы ключей методом быстрой сортировки\n");
    printf("11. Проверка эффективности сортировок\n");
    printf("12. Просмотр таблицы данных в соответствии с массивом ключей \n");
    printf("0. Завершение работы \n");
    printf("Выберите номер опции: ");
}
